finger.org
#+INCLUDE: ./main.setup
#+TITLE: finger
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-14

* 介绍
  :PROPERTIES: 
  :LANG: zh
  :END:      
  사용자 정보를 보여주는 프로그램이다.

  사용자들의 계정 정보를 보여준다.

* 先决条件
  :PROPERTIES: 
  :LANG: zh
  :END:      

* 安装
  :PROPERTIES: 
  :LANG: zh
  :END:      

* 安装的软件包
  :PROPERTIES: 
  :LANG: zh
  :END:      

* 检查
  :PROPERTIES: 
  :LANG: zh
  :END:      

* 组态
  :PROPERTIES: 
  :LANG: zh
  :END:      

* 如何使用
  :PROPERTIES: 
  :LANG: zh
  :END:      
  - -s : 사용자의 로그인 이름, 실제 이름, 터미널 이름, 쓰기 상황 (만약 쓰기 권한이 거부되어 있으면 터미널 이름 뒤에 `*' 이 붙는다.), 아이들 타임, 로그인 시간, 사무실 위치, 사무실 휴대폰 번호가 보여진다.
	- 로그인 시간이 6개월 이상 지난게 아니라면 로그인 시간은 월, 일, 시간, 분 순으로 보여진다.
	- 로그인 시간이 6개월 이상 경과했을 경우 다른것들은 제외하고 연 수(years) 만 보여진다.
	- 알 수 없는 장치 혹은 존재하지 않는 아이들 그리고 로그인 시간들은 하나의 별표(*)로 보여진다.
  - -l : 멀티 라인 포맷으로 보여진다.
	- 모든 정보는 <b>-s</b> 옵션으로 보여진다. 또한 사용자 홈 디렉토리, 홈 폰 번호, 로그인 쉘, 메일 상황, 사용자 홈 디렉토리에 있는 "<u>.plan</u>", "<u>.project</u>", "<u>.pgpkey</u>", "<u>.forward</u>" 파일들의 내용을 보여진다.
	- 휴대폰 번호는 ``+N-NNN-NNN-NNNN`` 형태로 11개의 10진수로 이루어 진다.
	- 번호 수가 7~10 개일 경우 적절한 서브셋으로 보여진다.
	- 5 개의 수일 경우 ``xN-NNNN`` 으로 설정된다.
	- 4 개의 수일 경우 ``xNNNN`` dmfh tjfwjdehlsek.
	- 장치의 쓰기 권한이 거부되었을 경우, ``(messages off)`` 장치 이름 끝에 붙는다.
	- 메일이 하나도 없을 경우 ``No Mail.`` 이 나타난다.
	- 새로운 메일을 받고 확인 했을 경우 Mail last read DDD MMM ### HH:MM YYY (TZ) 형태로 나타난다.
	- 새로운 메일이 도착했을 경우 ``Neew mail received...``, ``Unread since ...`` 로 나타난다.
  - -p: -l 옵션 사용시 나올 수 있는 "<u>.plan</u>", "<u>.project</u>", "<u>.pgpkey</u>" 파일들이 보여지지 않도록 한다.
  - -m: 사용자 이름들의 매칭을 방지한다.
	- 사용자는 보통 로그인 이름을 사용하더라도, 실제 이름에 매칭된다. -m 옵션이 제공되지 않을 경우.

* 参考
  :PROPERTIES: 
  :LANG: zh
  :END:      

