ko/finger.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<!-- 2018-02-20 Tue 01:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>finger</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>
</head>
<body>
<div id="content">
<h1 class="title">finger</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6884ca3">소개</a></li>
<li><a href="#org4aa4933">필요 사항</a></li>
<li><a href="#org228c6e0">설치</a></li>
<li><a href="#org435d35e">설치된 패키지</a></li>
<li><a href="#org272996f">확인</a></li>
<li><a href="#orgc38b335">설정</a></li>
<li><a href="#org85c5beb">사용법</a></li>
<li><a href="#org4dc6476">참고자료</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6884ca3" class="outline-2">
<h2 id="org6884ca3">소개</h2>
<div class="outline-text-2" id="text-org6884ca3">
<p>
사용자 정보를 보여주는 프로그램이다.
</p>

<p>
사용자들의 계정 정보를 보여준다.
</p>
</div>
</div>

<div id="outline-container-org4aa4933" class="outline-2">
<h2 id="org4aa4933">필요 사항</h2>
<div class="outline-text-2" id="text-org4aa4933">
</div>
</div>

<div id="outline-container-org228c6e0" class="outline-2">
<h2 id="org228c6e0">설치</h2>
<div class="outline-text-2" id="text-org228c6e0">
</div>
</div>

<div id="outline-container-org435d35e" class="outline-2">
<h2 id="org435d35e">설치된 패키지</h2>
<div class="outline-text-2" id="text-org435d35e">
</div>
</div>

<div id="outline-container-org272996f" class="outline-2">
<h2 id="org272996f">확인</h2>
<div class="outline-text-2" id="text-org272996f">
</div>
</div>

<div id="outline-container-orgc38b335" class="outline-2">
<h2 id="orgc38b335">설정</h2>
<div class="outline-text-2" id="text-orgc38b335">
</div>
</div>

<div id="outline-container-org85c5beb" class="outline-2">
<h2 id="org85c5beb">사용법</h2>
<div class="outline-text-2" id="text-org85c5beb">
<ul class="org-ul">
<li>-s : 사용자의 로그인 이름, 실제 이름, 터미널 이름, 쓰기 상황 (만약 쓰기 권한이 거부되어 있으면 터미널 이름 뒤에 `*' 이 붙는다.), 아이들 타임, 로그인 시간, 사무실 위치, 사무실 휴대폰 번호가 보여진다.
<ul class="org-ul">
<li>로그인 시간이 6개월 이상 지난게 아니라면 로그인 시간은 월, 일, 시간, 분 순으로 보여진다.</li>
<li>로그인 시간이 6개월 이상 경과했을 경우 다른것들은 제외하고 연 수(years) 만 보여진다.</li>
<li>알 수 없는 장치 혹은 존재하지 않는 아이들 그리고 로그인 시간들은 하나의 별표(*)로 보여진다.</li>
</ul></li>
<li>-l : 멀티 라인 포맷으로 보여진다.
<ul class="org-ul">
<li>모든 정보는 &lt;b&gt;-s&lt;/b&gt; 옵션으로 보여진다. 또한 사용자 홈 디렉토리, 홈 폰 번호, 로그인 쉘, 메일 상황, 사용자 홈 디렉토리에 있는 "&lt;u&gt;.plan&lt;/u&gt;", "&lt;u&gt;.project&lt;/u&gt;", "&lt;u&gt;.pgpkey&lt;/u&gt;", "&lt;u&gt;.forward&lt;/u&gt;" 파일들의 내용을 보여진다.</li>
<li>휴대폰 번호는 ``+N-NNN-NNN-NNNN`` 형태로 11개의 10진수로 이루어 진다.</li>
<li>번호 수가 7~10 개일 경우 적절한 서브셋으로 보여진다.</li>
<li>5 개의 수일 경우 ``xN-NNNN`` 으로 설정된다.</li>
<li>4 개의 수일 경우 ``xNNNN`` dmfh tjfwjdehlsek.</li>
<li>장치의 쓰기 권한이 거부되었을 경우, ``(messages off)`` 장치 이름 끝에 붙는다.</li>
<li>메일이 하나도 없을 경우 ``No Mail.`` 이 나타난다.</li>
<li>새로운 메일을 받고 확인 했을 경우 Mail last read DDD MMM ### HH:MM YYY (TZ) 형태로 나타난다.</li>
<li>새로운 메일이 도착했을 경우 ``Neew mail received...``, ``Unread since ...`` 로 나타난다.</li>
</ul></li>
<li>-p: -l 옵션 사용시 나올 수 있는 "&lt;u&gt;.plan&lt;/u&gt;", "&lt;u&gt;.project&lt;/u&gt;", "&lt;u&gt;.pgpkey&lt;/u&gt;" 파일들이 보여지지 않도록 한다.</li>
<li>-m: 사용자 이름들의 매칭을 방지한다.
<ul class="org-ul">
<li>사용자는 보통 로그인 이름을 사용하더라도, 실제 이름에 매칭된다. -m 옵션이 제공되지 않을 경우.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4dc6476" class="outline-2">
<h2 id="org4dc6476">참고자료</h2>
<div class="outline-text-2" id="text-org4dc6476">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-14</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-20 Tue 01:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
